{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/db1ed5e2-2c4a-4669-82d7-715e689818b7')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/db1ed5e2-2c4a-4669-82d7-715e689818b7')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2021-03-01-preview",
            "properties": {
                "displayName": "Defender for IoT - Solution deleted",
                "description": "Defender for IoT has been delected for subcription",
                "severity": "Medium",
                "enabled": true,
                "query": "AzureActivity\r\n| where OperationName == \"Delete IoT security solutions\" and ActivityStatus == \"Succeeded\"\r\n| project DefenderIoTInstance =ResourceId, SubscriptionId, ResourceId, IP=CallerIpAddress, User=Caller, OperationName",
                "queryFrequency": "PT1H",
                "queryPeriod": "PT1H",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT5H",
                "suppressionEnabled": false,
                "tactics": [],
                "alertRuleTemplateName": null,
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5H",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": [],
                        "groupByCustomDetails": []
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "AlertPerResult"
                },
                "alertDetailsOverride": null,
                "customDetails": {
                    "DefenderIoTInstance": "DefenderIoTInstance",
                    "OperationName": "OperationName",
                    "ResourceId": "ResourceId",
                    "Subscription": "SubscriptionId"
                },
                "entityMappings": [
                    {
                        "entityType": "IP",
                        "fieldMappings": [
                            {
                                "identifier": "Address",
                                "columnName": "IP"
                            }
                        ]
                    },
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "AadUserId",
                                "columnName": "User"
                            }
                        ]
                    }
                ]
            }
        }
    ]
}